app/controllers/users/registrations_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)
UPDATE "users" SET "updated_at" = ?, "role" = ? WHERE "users"."id" = ?  [["updated_at", "2019-09-25 13:40:30.810151"], ["role", 0], ["id", 3]]
---
  def create
     super
     if(is_first_user)
      @user.role = 2
     else
      @user.role = 0
     @user.save

SELECT COUNT(*) FROM "users"
---
  def is_first_user
    User.all.size == 1